#include "main.h"

/***************************************************************************************
函数名称  ：SysTick_Init
函数功能  ：SysTick初始化函数
函数形参  ：产生时间片的系统节拍时间
函数返回值：无
函数描述  ：
****************************************************************************************/
void SysTick_Init(u16 Time)
{
	/* 选择SysTick定时器时钟源 */
	SysTick->CTRL |= 1 << 2;            //时钟源选择：内部时钟源（72M）
	
	/* 设置系统节拍时间值 */
	SysTick->LOAD = Time * 72 * 1000;   //把时间初始值写入重装载寄存器（时间单位：毫秒）
	SysTick->VAL = 0;                   //把计数寄存器清零s
	
	/* 设置SysTick中断 */
	SysTick->CTRL |= 1 << 1;            //使能SysTick中断
	
	/* 使能SysTick中断 */
	SysTick->CTRL |= 1 << 0;            //开启定时器
}

void SysTick_Handler(void)
{   

}
