#include "main.h"

/****************************************************************************************
函数名称： TIM_4_Init
函数功能： TIM4初始化
函数形参： 无
函数返回值： 无
函数描述：
*****************************************************************************************/
void TIM_4_Init(void)
{
	RCC->APB1ENR |= (1 << 2);    //开启定时器6时钟
	
	TIM4->CR1 |= (1 << 7);       //使能预装载影子寄存器
	TIM4->CR1 &= ~(1 << 3);      //计数溢出不停止
	TIM4->CR1 |= (1 << 2);       //只能由计数溢出请求中断
	TIM4->CR1 &= ~(1 << 1);      //使能产生更新事件
	
	TIM4->CR1 &= ~(1 << 0);      //关闭定时器
	TIM4->SR = 0;                //溢出标志位清零
}

/****************************************************************************************
函数名称： Delay_ms
函数功能： TIM4毫秒延时
函数形参： 无
函数返回值： 无
函数描述：最大：65535ms
*****************************************************************************************/
void Delay_ms(int time)
{
	/* 配置预分频和重装值 */
	TIM4->PSC = 7200 - 1;		     //预分频系数  72分频 - 1M - 1us  乘以100 7200 -- 0.1ms
	TIM4->ARR = time * 10;       //重装值      计数10次为1ms   
	
	TIM4->CNT = 0;				       //清空计数器
	TIM4->SR &= ~(0x01 << 0);    //溢出标志位清0
	TIM4->EGR |= (1 << 0);       //软件产生更新事件,把设定值写入影子寄存器
	TIM4->CR1 |= 1 << 0;	       //开启定时器	
	
	while( !(TIM4->SR & (1 << 0)) )
	{
		/* 等待时间到达 */
	}
	
	TIM4->CR1 &= ~(1 << 0);		   //关闭定时器
}

/****************************************************************************************
函数名称： Delay_us
函数功能： TIM4微秒延时
函数形参： 无
函数返回值： 无
函数描述：最大：65535us
*****************************************************************************************/
void Delay_us(int time)
{
	//配置分频  //72分频 1Mhz  1us计数器+1
	TIM4->PSC = 72-1;  
	//装入延时时间
	TIM4->ARR = time;
	//计数器初始值
	TIM4->CNT = 0;
	
	TIM4->EGR |= 1<<0;           //软件产生更新事件
	TIM4->SR &= ~(1<<0);         //清楚标志位
	
	//开启定时器
	TIM4->CR1 |= 1<<0;
	
	while(!(TIM4->SR & (1<<0))); //等待溢出事件
	
	TIM4->SR &= ~(1<<0);         //清楚标志位
	//关闭定时器
	TIM4->CR1 &= ~(1<<0);
}
